modules/samples/microprofile/microprofile-jwt/src/main/resources/configs/add-role-creditor.xml

<!--
  ~ Copyright (c) 2018, WSO2 Inc. (http://www.wso2.org) All Rights Reserved.
  ~
  ~ WSO2 Inc. licenses this file to you under the Apache License,
  ~ Version 2.0 (the "License"); you may not use this file except
  ~ in compliance with the License.
  ~ You may obtain a copy of the License at
  ~
  ~     http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing,
  ~ software distributed under the License is distributed on an
  ~ "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
  ~ KIND, either express or implied.  See the License for the
  ~ specific language governing permissions and limitations
  ~ under the License.
  -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ser="http://service.ws.um.carbon.wso2.org"
                  xmlns:xsd="http://dao.service.ws.um.carbon.wso2.org/xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:addRole>
            <!--Optional:-->
            <ser:roleName>Creditor</ser:roleName>
            <!--Zero or more repetitions:-->
            <ser:userList>alex</ser:userList>
            <!--Zero or more repetitions:-->
            <ser:permissions>
                <!--Optional:-->
                <xsd:action>ui.execute</xsd:action>
                <!--Optional:-->
                <xsd:resourceId>/permission/admin/login</xsd:resourceId>
            </ser:permissions>
            <ser:permissions>
                <!--Optional:-->
                <xsd:action>ui.execute</xsd:action>
                <!--Optional:-->
                <xsd:resourceId>/permission/admin/manage/humantask/viewtasks</xsd:resourceId>
            </ser:permissions>
            <ser:permissions>
                <!--Optional:-->
                <xsd:action>ui.execute</xsd:action>
                <!--Optional:-->
                <xsd:resourceId>/permission/admin/manage/identity/workflow/profile/view</xsd:resourceId>
            </ser:permissions>
            <ser:permissions>
                <!--Optional:-->
                <xsd:action>ui.execute</xsd:action>
                <!--Optional:-->
                <xsd:resourceId>/permission/admin/manage/identity/applicationmgt</xsd:resourceId>
            </ser:permissions>
        </ser:addRole>
    </soapenv:Body>
</soapenv:Envelope>
